Белгипрозем_2017/src/Catalogs/ШаблоныСогласования/ШаблоныСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСогласования</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПроверкаДела4Уровня</name>
      <description>Проверка дела зам. гл. инженера (4 уровень)</description>
    </items>
    <items>
      <name>ПроверкаДела2Уровня</name>
      <description>Проверка дела отдел (2 уровень)</description>
    </items>
    <items>
      <name>ПроверкаДела1Уровня</name>
      <description>Проверка дела отряд (1 уровень)</description>
    </items>
    <items>
      <name>ПроверкаДела3Уровня</name>
      <description>Проверка дела сектор контроля (3 уровень)</description>
    </items>
    <items>
      <name>ПроверкаДелаФилиал</name>
      <description>Проверка дела филиал</description>
    </items>
  </predefined>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСогласования</name>
    <type>
      <types>EnumRef.ВариантыМаршрутизацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецШаблона</name>
    <type>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУсловия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБизнесПроцесса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьНаименованиеПредмета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПерсональныйШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>в днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЧас</name>
    <comment>в часах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОтложенногоСтарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланАвтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазныеСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонВКомплексномПроцессе</name>
    <comment>Показывает, что данный шаблон бизнес-процесса используется в комплексном процессе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокСогласования</name>
      <type>
        <types>EnumRef.ПорядокВыполненияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.УсловияМаршрутизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредметаУсловия</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполненияЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрудозатратыПланИсполнителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предметы</name>
    <attributes>
      <name>РольПредмета</name>
      <type>
        <types>EnumRef.РолиПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредметаОснование</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.ТемыОбсуждений</types>
        <types>CatalogRef.Корреспонденты</types>
        <types>CatalogRef.Проекты</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>CatalogRef.СообщенияОбсуждений</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонОснование</name>
      <type>
        <types>CatalogRef.ШаблоныИсходящихДокументов</types>
        <types>CatalogRef.Файлы</types>
        <types>String</types>
        <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
        <types>CatalogRef.ШаблоныВходящихДокументов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыЗадач</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>BusinessProcessRoutePointRef.Согласование</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/НастройкаШаблоновБизнесПроцессов/НастройкаШаблоновБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаШаблоновБизнесПроцессов</name>
  <resources>
    <name>ЗапрещеноИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтерактивныйЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидИнтерактивногоСобытия</name>
    <type>
      <types>EnumRef.ВидыИнтерактивныхДействий</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонБизнесПроцесса</name>
    <type>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Условие</name>
    <type>
      <types>CatalogRef.УсловияМаршрутизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ШаблоныСогласования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей шаблона процесса
//
// Возвращаемое значение:
//   Структура
//     Наименование
//     Родитель
//     Ответственный
//     Комментарий
//     ДобавлятьНаименованиеПредмета
//     НаименованиеБизнесПроцесса
//     Описание
//     СрокИсполнения
//     СрокИсполненияЧас
//     Важность
//     Автор
//     Предметы
//     РабочаяГруппа
//     ВариантСогласования
//     ПодписыватьЭП
//     Исполнители
//     НастрокиШаблона
//     РазныеСроки
//
Функция ПолучитьСтруктуруШаблонаСогласования() Экспорт
	
	ПараметрыПроцесса = Новый Структура;
	ПараметрыПроцесса.Вставить("Наименование");
	ПараметрыПроцесса.Вставить("Родитель");
	ПараметрыПроцесса.Вставить("Ответственный");
	ПараметрыПроцесса.Вставить("Комментарий");
	ПараметрыПроцесса.Вставить("ДобавлятьНаименованиеПредмета");
	ПараметрыПроцесса.Вставить("НаименованиеБизнесПроцесса");
	ПараметрыПроцесса.Вставить("Описание");
	ПараметрыПроцесса.Вставить("Важность");
	ПараметрыПроцесса.Вставить("Автор");
	ПараметрыПроцесса.Вставить("ШаблонВКомплексномПроцессе");
	ПараметрыПроцесса.Вставить("ВладелецШаблона");
	
	Предметы = Новый ТаблицаЗначений;
	Предметы.Колонки.Добавить("РольПредмета");
	Предметы.Колонки.Добавить("ИмяПредмета");
	Предметы.Колонки.Добавить("ТочкаМаршрута");
	Предметы.Колонки.Добавить("ИмяПредметаОснование");
	Предметы.Колонки.Добавить("ШаблонОснование");
	ПараметрыПроцесса.Вставить("Предметы", Предметы);
	
	РабочаяГруппаШаблона = Новый ТаблицаЗначений;
	РабочаяГруппаШаблона.Колонки.Добавить("Участник");
	РабочаяГруппаШаблона.Колонки.Добавить("ОсновнойОбъектАдресации");
	РабочаяГруппаШаблона.Колонки.Добавить("ДополнительныйОбъектАдресации");
	ПараметрыПроцесса.Вставить("РабочаяГруппа", РабочаяГруппаШаблона);
	
	НастрокиШаблона = Новый ТаблицаЗначений;
	НастрокиШаблона.Колонки.Добавить("ВидДокумента");
	Если Константы.ИспользоватьУчетПоОрганизациям.Получить() Тогда
		НастрокиШаблона.Колонки.Добавить("Организация");
	КонецЕсли;
	НастрокиШаблона.Колонки.Добавить("Условие");
	НастрокиШаблона.Колонки.Добавить("ЗапрещеноИзменение");
	НастрокиШаблона.Колонки.Добавить("ИнтерактивныйЗапуск");
	НастрокиШаблона.Колонки.Добавить("ВидИнтерактивногоСобытия");
	ПараметрыПроцесса.Вставить("НастрокиШаблона", НастрокиШаблона);
	
	ПараметрыПроцесса.Вставить("СрокИсполнения");
	ПараметрыПроцесса.Вставить("СрокИсполненияЧас");
	
	ТаблицаИсполнителей = Новый ТаблицаЗначений;
	ТаблицаИсполнителей.Колонки.Добавить("Исполнитель");
	ТаблицаИсполнителей.Колонки.Добавить("ОсновнойОбъектАдресации");
	ТаблицаИсполнителей.Колонки.Добавить("ДополнительныйОбъектАдресации");
	ТаблицаИсполнителей.Колонки.Добавить("ПорядокСогласования");
	ТаблицаИсполнителей.Колонки.Добавить("СрокИсполнения");
	ТаблицаИсполнителей.Колонки.Добавить("СрокИсполненияЧас");
	ПараметрыПроцесса.Вставить("Исполнители", ТаблицаИсполнителей);
	
	ПараметрыПроцесса.Вставить("ВариантСогласования");
	ПараметрыПроцесса.Вставить("РазныеСроки");
	
	ПараметрыПроцесса.Вставить("ПодписыватьЭП");
	
	Возврат ПараметрыПроцесса;
	
КонецФункции

// Создает шаблон процесса.
//
// Параметры:
//   СтруктураШаблона - Структура - структура полей шаблона исполнение.
//
// Возвращаемый параметр:
//   СправочникСсылка.ШаблоныСогласования
//
Функция СоздатьШаблонСогласования(СтруктураШаблона) Экспорт
	
	НовыйШаблон = СоздатьЭлемент();
	ШаблоныБизнесПроцессов.ЗаполнитьШаблон(НовыйШаблон, СтруктураШаблона);
	
	// Заполнение таблицы Исполнителей
	
	Для Каждого СтрокаИсполнителя Из СтруктураШаблона.Исполнители Цикл
		
		НоваяСтрокаИсполнителя = НовыйШаблон.Исполнители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИсполнителя, СтрокаИсполнителя);
		
	КонецЦикла;
	
	НовыйШаблон.Записать();
	
	НастрокиШаблона = 
	СтруктураШаблона.НастрокиШаблона.Скопировать();
	НастрокиШаблона.Колонки.Добавить("ШаблонБизнесПроцесса");
	НастрокиШаблона.ЗаполнитьЗначения(НовыйШаблон.Ссылка, "ШаблонБизнесПроцесса");
	
	НаборЗаписей = РегистрыСведений.НастройкаШаблоновБизнесПроцессов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ШаблонБизнесПроцесса.Установить(НовыйШаблон.Ссылка);
	НаборЗаписей.Загрузить(НастрокиШаблона);
	НаборЗаписей.Записать();
		
	Возврат НовыйШаблон.Ссылка;
	
КонецФункции

Функция ИмяПроцесса(ШаблонСсылка) Экспорт
	
	Возврат "Согласование";
	
КонецФункции

// Показывает, может ли процесс по данному шаблону использоваться в качестве части комплексного процесса
Функция МожетИспользоватьсяВКомплексномПроцессе() Экспорт
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("ВладелецШаблона")
			И (ТипЗнч(Параметры.ВладелецШаблона) = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов")
			ИЛИ ТипЗнч(Параметры.ВладелецШаблона) = Тип("БизнесПроцессСсылка.КомплексныйПроцесс")) 
			ИЛИ Параметры.Свойство("Ключ")
			И (ТипЗнч(Параметры.Ключ.ВладелецШаблона) = Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов")
			ИЛИ ТипЗнч(Параметры.Ключ.ВладелецШаблона) = Тип("БизнесПроцессСсылка.КомплексныйПроцесс")) Тогда
	
			Если НЕ Параметры.Свойство("ВладелецШаблона") Тогда
				Параметры.Вставить("ВладелецШаблона", Параметры.Ключ.ВладелецШаблона);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_УправлениеДоступом

Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат 
		"Ответственный,
		|Ссылка,
		|ШаблонВКомплексномПроцессе,
		|ВладелецШаблона";
	
КонецФункции

Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ШаблоныБизнесПроцессов.ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа);	
	
КонецПроцедуры	

// Возвращает Истина, указывая тем самым что этот объект сам заполняет свои права 
Функция ЕстьМетодЗаполнитьПраваДоступа() Экспорт
	
	Возврат Истина;
	
КонецФункции	

// Заполняет параметр ПраваДоступа правами доступа, вычисляя их на 
// основании переданного дескриптора доступа.
// Если указан параметр ПротоколРасчетаПрав, то в него 
// заносится список данных, которые были использованы для расчета прав.
Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт
	
	ШаблоныБизнесПроцессов.ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
